/***********************************************************************************
 * 文 件 名   : GwComDef.h
 * 负 责 人   : Edward
 * 创建日期   : 2017年2月21日
 * 文件描述   : 公共的定义内容
 * 版权说明   : Copyright (c) 2008-2017   无锡飞雪网络科技有限公司
 * 其    他   : 
 * 修改日志   : 
***********************************************************************************/
#ifndef __GW_COM_DEF_H__
#define __GW_COM_DEF_H__

#ifdef __cplusplus
extern "C"
{
#endif

/*********************************************************************
 * INCLUDES
 */
#include <stdint.h>
#include "errorCode.h"
/*********************************************************************
 * CONSTANTS
 */
 
/*********************************************************************
 * MACROS
 */

#define ARRAY_SIZE(X) (sizeof(X) / sizeof((X)[0]))

#define IEEE_ADDR_SIZE		8

#define SUCCESS		0x00
#define FAILED		0x01

#define FALSE		FAILED
#define TRUE		SUCCESS

/*********************************************************************
 * TYPEDEFS
 */

/*********************************************************************
 * VARIABLES
 */
 
    
/*********************************************************************
 * FUNCTIONS
 */
 

/*********************************************************************/

#ifdef __cplusplus
}
#endif

#endif /* __GW_COM_DEF_H__ */
